Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/bugs.tmx
Source language: en
Languages: pl

source: Reporting Bugs
pl: Zgłaszanie błędów

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
pl: Python jest dojrzałym językiem programowania, który posiada ugruntowaną reputację, jako język stabilny. Aby utrzymać tę reputację, jego twórcy chcieliby dowiedzieć się o jakichkolwiek jego błędach, na które zdarzyło Ci się natknąć.

source: Documentation bugs
pl: Błędy dokumentacji

source: If you find a bug in this documentation or would like to propose an improvement, please send an e-mail to docs@python.org describing the bug and where you found it. If you have a suggestion how to fix it, include that as well.
pl: Jeśli znalazłeś błąd w tej dokumentacji lub masz pomysł, jak ją ulepszyć, wyślij maila na adres: docs@python.org z opisem błędu i tego jak się na niego natknąłeś. Jeśli masz sugestię jak go poprawić, załącz ją także.

source: docs@python.org is a mailing list run by volunteers; your request will be noticed, even if it takes a while to be processed.
pl: docs@python.org jest listą dyskusyjną utrzymywaną przez społeczność. Twoja wiadomość zostanie zauważona, nawet jeśli nie uzyskasz natychmiastowej reakcji.

source: Of course, if you want a more persistent record of your issue, you can use the issue tracker for documentation bugs as well.
pl: Oczywiście, jeśli wolał(a)byś bardziej utrwalone zgłoszenie twojego problemu, możesz również skorzystać z systemu zgłaszania błędów Pythona.

source: Using the Python issue tracker
pl: Jak korzystać z systemu zgłaszania błędów Pythona

source: Bug reports for Python itself should be submitted via the Python Bug Tracker (http://bugs.python.org/). The bug tracker offers a Web form which allows pertinent information to be entered and submitted to the developers.
pl: Raporty o błędach w języku python należy wysyłać przy pomocy systemu zgłaszania błędów języka python (http://bugs.python.org). System zgłoszeń oferuje formularz dla wprowadzania stosownych informacji i przekazywania ich twórcom języka.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the bug database using the search box on the top of the page.
pl: Pierwszym krokiem przy wypełnianiu zgłoszenia jest ustalenie, czy dany problem został już zgłoszony. Zaletą takiego postępowania, oprócz oszczędności czasu twórców języka, jest to, że dowiadujesz się, co uczyniono, aby naprawić dany błąd. Może tak być, że problem został naprawiony w następnej wersji, lub więcej informacji szczegółowych jest wymagane (w takim przypadku uprasza się o ich dostarczenie, jeśli masz taką możliwość!). Aby to zrobić, przejrzyj spis problemów używając pola wyszukiwania umieszczonego u góry strony.

source: If the problem you're reporting is not already in the bug tracker, go back to the Python Bug Tracker and log in. If you don't already have a tracker account, select the "Register" link or, if you use OpenID, one of the OpenID provider logos in the sidebar. It is not possible to submit a bug report anonymously.
pl: Jeśli problem nie został jeszcze zgłoszony, powróć do zgłaszania błędu i zaloguj się. Jeśli nie masz jeszcze konta, wybierz link "zarejestruj się"; jeśli korzystasz z OpenID, kliknij na logo swojego providera. Nie jest możliwe zgłoszenie błędu anonimowo.

source: Being now logged in, you can submit a bug. Select the "Create New" link in the sidebar to open the bug reporting form.
pl: Będąc już zalogowanym, możesz zgłosić błąd. Kliknij w link "Stwórz nowy" znajdujący się na panelu bocznym, aby otworzyć formularz zgłaszania błędu.

source: The submission form has a number of fields. For the "Title" field, enter a *very* short description of the problem; less than ten words is good. In the "Type" field, select the type of your problem; also select the "Component" and "Versions" to which the bug relates.
pl: Formularz zgłoszeniowy posiada wiele pól. Do pola "Tytuł" wpisz *dość* krótki opis problemu, najlepiej mniej niż dziesięć słów. W polu "Typ" wybierz typ problemu; wybierz również "Komponent" i "Wersje" do których odnosi się błąd.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
pl: W polu "Komentarz", opisz problem szczegółowo, wskazując co miało nastąpić, a co nastąpiło. Pamiętaj, aby podać, czy jakiekolwiek moduły dodatkowe były stosowane i jakich platform sprzętowych i programowych używałeś (w tym informacji o wersji w stosownych przypadkach).

source: Each bug report will be assigned to a developer who will determine what needs to be done to correct the problem. You will receive an update each time action is taken on the bug. See http://www.python.org/dev/workflow/ for a detailed description of the issue workflow.
pl: Każdy raport o błędzie zostanie przypisany do programisty, który zadecyduje o tym, co należy zrobić, aby rozwiązać problem. Otrzymasz powiadomienie za każdym razem gdy zostanie podjęte działanie w odpowiedzi na błąd. Zobacz http://www.python.org/dev/workflow/ aby uzyskać szczegółowy opis opracowania w tym temacie.

source: See also
pl: Zobacz też:

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
pl: Artykuł, który opowiada bardziej szczegółowo o tym jak stworzyć użyteczny raport o błędzie. Opisuje, jakiego rodzaju informacje są użyteczne i dlaczego.

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
pl: Informacja o pisaniu dobrych raportów błędów. Niektóre z nich dotyczą projektu Mozilla, choć opisują ogólnie dobre zwyczaje.
